artillery/configurations/sieve-of-eratosthenes/gcp/temp.yaml
config:
  phases:
    - duration: 100
      arrivalCount: 60

scenarios:
  - flow:
      - post:
          url: "{{ target }}"
          json:
            num: __NUM__
          capture:
            - json: "$.traceId"
              as: traceId
            - json: "$.primes"
              as: primes
            - json: "$.num"
              as: num
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - log: |
          Trace ID: {{ traceId }},
          Primes: {{ primes }},
          Num: {{ num }}
    name: "Sieve-of-Eratosthenes"